tutorials/lagrangian/porousExplicitSourceReactingParcelFoam/parcelInBox/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    outlet
    {
        type            wall;
        nFaces          25;
        startFace       300;
    }
    walls
    {
        type            wall;
        nFaces          50;
        startFace       325;
    }
    back
    {
        type            symmetryPlane;
        nFaces          25;
        startFace       375;
    }
    front
    {
        type            symmetryPlane;
        nFaces          25;
        startFace       400;
    }
    defaultFaces
    {
        type            empty;
        nFaces          25;
        startFace       425;
    }
)


// ************************************************************************* //
